In [1]:
#Q1. List any five functions of the pandas library with execution.


import pandas as pd

a=pd .read_csv("https://raw.githubusercontent.com/datasets/covid-19/main/data/countries-aggregated.csv")

In [2]:
a

              Date      Country  Confirmed  Recovered  Deaths
0       2020-01-22  Afghanistan          0          0       0
1       2020-01-23  Afghanistan          0          0       0
2       2020-01-24  Afghanistan          0          0       0
3       2020-01-25  Afghanistan          0          0       0
4       2020-01-26  Afghanistan          0          0       0
...            ...          ...        ...        ...     ...
161563  2022-04-12     Zimbabwe     247094          0    5460
161564  2022-04-13     Zimbabwe     247160          0    5460
161565  2022-04-14     Zimbabwe     247208          0    5462
161566  2022-04-15     Zimbabwe     247237          0    5462
161567  2022-04-16     Zimbabwe     247237          0    5462

[161568 rows x 5 columns]

In [3]:
# 5  functions
a.head()

         Date      Country  Confirmed  Recovered  Deaths
0  2020-01-22  Afghanistan          0          0       0
1  2020-01-23  Afghanistan          0          0       0
2  2020-01-24  Afghanistan          0          0       0
3  2020-01-25  Afghanistan          0          0       0
4  2020-01-26  Afghanistan          0          0       0

In [4]:
a.tail()

              Date   Country  Confirmed  Recovered  Deaths
161563  2022-04-12  Zimbabwe     247094          0    5460
161564  2022-04-13  Zimbabwe     247160          0    5460
161565  2022-04-14  Zimbabwe     247208          0    5462
161566  2022-04-15  Zimbabwe     247237          0    5462
161567  2022-04-16  Zimbabwe     247237          0    5462

In [5]:
a.describe()

          Confirmed     Recovered         Deaths
count  1.615680e+05  1.615680e+05  161568.000000
mean   7.361569e+05  1.453967e+05   13999.436089
std    3.578884e+06  9.748275e+05   59113.581271
min    0.000000e+00  0.000000e+00       0.000000
25%    1.220000e+03  0.000000e+00      17.000000
50%    2.369200e+04  1.260000e+02     365.000000
75%    2.558420e+05  1.797225e+04    4509.000000
max    8.062512e+07  3.097475e+07  988609.000000

In [6]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 161568 entries, 0 to 161567
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date       161568 non-null  object
 1   Country    161568 non-null  object
 2   Confirmed  161568 non-null  int64
 3   Recovered  161568 non-null  int64
 4   Deaths     161568 non-null  int64
dtypes: int64(3), object(2)
memory usage: 6.2+ MB

In [8]:
a.dtypes

Date         object
Country      object
Confirmed     int64
Recovered     int64
Deaths        int64
dtype: object

In [11]:
'''Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.'''



df=pd.DataFrame({'A':[10,20,30,],'B':[1,2,3],'C':[8,9,10]})
print(df)

    A  B   C
0  10  1   8
1  20  2   9
2  30  3  10

In [18]:
df1=df.set_index(pd.Index(range(1,len(df)*2,2)))

In [19]:
df1

    A  B   C
1  10  1   8
3  20  2   9
5  30  3  10

In [113]:
'''Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.'''


dfa=pd.DataFrame({'values':[10, 20, 30, 40, 50],})

In [114]:
dfa

   values
0      10
1      20
2      30
3      40
4      50

In [115]:
dfa['values'][0:2]

0    10
1    20
Name: values, dtype: int64

In [116]:
b=dfa['values'].tolist()

In [117]:
b

[10, 20, 30, 40, 50]

In [138]:
s = []

def get(n):
    total = 0
    for i in n[0:3]:
        s.append(i)
        total = sum(s)
        print(total)

In [144]:
s=0
for i in range(3):
   
    s=s+b[i]
    print(s)

10
30
60

In [180]:
'''Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.'''

"Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column\n'Word_Count' that contains the number of words in each row of the 'Text' column."

In [181]:



df=pd.DataFrame({'Text':['ANI','AMITH','HARI','krishna']})


df['Word_Count'] = df['Text'].str.len()


print(df)

      Text  Word_Count
0      ANI           3
1    AMITH           5
2     HARI           4
3  krishna           7

In [186]:
df

      Text  Word_Count
0      ANI           3
1    AMITH           5
2     HARI           4
3  krishna           7

In [ ]:
#Q5. How are DataFrame.size() and DataFrame.shape() different?

'''df.size=gives total elements under all column and rows in a data frame.
df.shape=gives no of rows and no of columns''

In [ ]:
#Q6. Which function of pandas do we use to read an excel file?

"a=pd.read_excel() is the function to read a excel"

In [189]:
'''Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.'''

"Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email\naddresses in the format 'username@domain.com'. Write a Python function that creates a new column\n'Username' in df that contains only the username part of each email address."

In [192]:
a

             Email
0  username@domain
1       ani@domain

In [204]:
import pandas as pd

# Create a sample DataFrame
a=pd.DataFrame({'Email':['username@domain','ani@domain']})

# Extract the username from the 'Email' column using the str.split() method
a['Username'] = a['Email'].str.split('@').str[0]

# Print the updated DataFrame
print(a)

             Email  Username
0  username@domain  username
1       ani@domain       ani

In [9]:
'''Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.'''

import pandas as pd
df1=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,10,9,3,1],'C':[1,10,4,5,2]})

df1

   A   B   C
0  3   5   1
1  8  10  10
2  6   9   4
3  2   3   5
4  9   1   2

In [10]:
df1[(df1['A']>5) & (df1['B']<10)]

   A  B  C
2  6  9  4
4  9  1  2

In [12]:
'''Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.'''



df2=pd.DataFrame({'Values':[1,2,3,4,5,6,7,8,12,23,45,56,78]})
df2

    Values
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8
8       12
9       23
10      45
11      56
12      78

In [13]:
df2.describe()

          Values
count  13.000000
mean   19.230769
std    24.688573
min     1.000000
25%     4.000000
50%     7.000000
75%    23.000000
max    78.000000

In [23]:
'''Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.'''


import pandas as pd


data = {'Date': ['2022-05-01', '2022-05-02', '2022-05-03', '2022-05-04', '2022-05-05', '2022-05-06', '2022-05-07', '2022-05-08', '2022-05-09', '2022-05-10', '2022-05-11', '2022-05-12', '2022-05-13', '2022-05-14', '2022-05-15', '2022-05-16', '2022-05-17', '2022-05-18', '2022-05-19', '2022-05-20'],
        'Sales': [20, 15, 18, 25, 27, 22, 23, 20, 17, 19, 24, 30, 29, 28, 26, 21, 18, 15, 14, 19]}
df = pd.DataFrame(data)

df['Date'] = pd.to_datetime(df['Date'])


df.set_index('Date', inplace=True)


df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

print(df)

            Sales  MovingAverage
Date
2022-05-01     20      20.000000
2022-05-02     15      17.500000
2022-05-03     18      17.666667
2022-05-04     25      19.500000
2022-05-05     27      21.000000
2022-05-06     22      21.166667
2022-05-07     23      21.428571
2022-05-08     20      21.428571
2022-05-09     17      21.714286
2022-05-10     19      21.857143
2022-05-11     24      21.714286
2022-05-12     30      22.142857
2022-05-13     29      23.142857
2022-05-14     28      23.857143
2022-05-15     26      24.714286
2022-05-16     21      25.285714
2022-05-17     18      25.142857
2022-05-18     15      23.857143
2022-05-19     14      21.571429
2022-05-20     19      20.142857

In [27]:
'''Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.'''

import pandas as pd

# create sample dataframe
df = pd.DataFrame({'Date': ['2023-01-01',
'2023-01-02',
'2023-01-03',
'2023-01-04',
'2023-01-05']})

# convert 'Date' column to datetime format
df['Date'] = pd.to_datetime(df['Date'])


df['Weekday'] = df['Date'].dt.day_name()

# print the updated dataframe
print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [30]:
'''Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.'''




def select_january_rows(df):
   
    df['Date'] = pd.to_datetime(df['Date'])
    
    january_df = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]

    return january_df

In [24]:
#Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs tobe imported?

'''" pandas " has to be imported !!!!!'''

'" pandas " has to be imported !!!!!'